org/_posts/2016-08-17-how-to-install-openmp-osx.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "How to install opemp support for clang on osx 10.11 el capitan"
date: 2016-08-17
comments: true
archive: true
notes: true
tags: notes
excerpt: Installation instructions regarding openmp support for clang
---
#+END_HTML

The easiest way to install opemp support for llvm clang compilesrs on
a mac osx 10.11 el capitan is via homebrew. We will use clang-omp
package from homebrew. The only problem is that clang-omp has been
removed from official homebrew repositories. But that is not a big
problem, because we can install even removed packages. The only thing
that we need to know is where the package resides in the homebrew
directory structure. In our case it is located
~homebrew/boneyard/clang-omp~.

Let's install it:

=brew install homebrew/boneyard/clang-omp=


Then follow instructions on the following websites

- [[https://clang-omp.github.io][clang-omp website]]
- [[http://stackoverflow.com/questions/33668323/clang-omp-in-xcode-under-el-capitan][stackoverflow]]
- [[https://forum.openframeworks.cc/t/openmp-under-osx/23999/2][openframworks]]
- [[http://superuser.com/questions/1110414/install-a-deleted-homebrew-formulae][stackexchange]]
- [[http://stackoverflow.com/questions/20321988/error-enabling-openmp-ld-library-not-found-for-lgomp-and-clang-errors/21789869#21789869][stackoverflow]]
- [[http://kylehalladay.com/all/blog/2014/07/15/Setting-Up-OpenMP-Mavericks.html][kylehalladay]]
- [[http://thecoatlessprofessor.com/programming/openmp-in-r-on-os-x/][thecoatlesprofessor]]
- [[https://software.intel.com/en-us/articles/using-intel-distribution-for-python-with-anaconda][important and easy intel-python installation on anaconda]]
- [[https://software.intel.com/en-us/articles/numpyscipy-with-intel-mkl][building numpy+scipy with intel-mkl]]
- [[https://software.intel.com/en-us/forums/intel-math-kernel-library/topic/383942][building numpy+scipy with intel-mkl 2]]
- [[https://thelostelectron.wordpress.com/tag/el-capitan/][install mkl compilers and libraries]]
- [[https://thelostelectron.wordpress.com/tag/el-capitan/][julia with mkl-intel]]
- [[http://quantlabs.net/blog/2015/12/instruction-to-get-python-data-science-working-on-mac/][install python, numpy-with-openblas]]
- [[http://dedupe.readthedocs.io/en/latest/OSX-Install-Notes.html][install python, numpy-with-openblas2]]
- [[http://deeplearning.net/software/theano/install_ubuntu.html#manual-openblas-instruction][install python, numpy-with-openblas3]]
- [[http://dedupe.readthedocs.io/en/latest/OSX-Install-Notes.html][haswell issues with openblas]]
- [[https://github.com/torch/dok/blob/master/docinstall/blas.md][detailed description installing torch against openblas and mkl-intel]]
- [[http://blog.yannisassael.com/2016/03/mkl-library-not-found-torch7/][install torch with intel-mkl]]
- [[https://www.arm-blog.com/setting-up-a-openvpn-server/][setting up an openvpn server]]
- [[http://javaguirre.me/2015/03/15/using-cyberghost-vpn-in-archlinux/][openvpn on different countries]]
- [[https://torrentfreak.com/which-vpn-services-take-your-anonymity-seriously-2014-edition-140315/2/][best anonymous proxies]]
- [[https://archlinuxarm.org/forum/viewtopic.php?f=31&t=9283][troubleshooting openvpn issues on arch]]
- [[http://readwrite.com/2014/04/10/raspberry-pi-vpn-tutorial-server-secure-web-browsing/][building openvpn on raspherry pi]]
- [[http://minecraft.gamepedia.com/Tutorials/Setting_up_a_server][setting up VPN server not with openvpn]]
- [[https://www.digitalocean.com/community/tutorials/initial-server-setup-with-arch-linux][setting up linux server]]
- [[http://earthpy.org/speed.html][how to speed up your python code]]
- [[http://www.shocksolution.com/2008/09/installing-numpy-with-the-intel-math-kernel-library-mkl/][install numpy with mkl-intel]]
- [[http://www.ankitsrivastava.net/2014/05/installing-pythonnumpy-with-atlas-support/][install python/numpy with atlas]]
- [[http://www.cs.colostate.edu/~idfah/main/tutorials/npspmkl][install numpy & scipy with openblas and mkl]]
- [[https://gehrcke.de/2014/02/building-numpy-and-scipy-with-intel-compilers-and-intel-mkl-on-a-64-bit-machine/][installing numpy & scipy with mkl]]
- [[http://alexsavio.github.io/numpy_scipy_mkl.html][better guide to numpy,scipy with mkl and blas]]
- [[https://github.com/numpy/numpy/issues/3912][check if numpy is linked against blas and mkl]]
- [[https://blog.semicolonsoftware.de/compiling-python-numpy-and-scipy-with-intel-compilers-and-intel-mkl/][another very detailed and good guide to install python, numpy and scipy with intel-mkl]]
- [[https://christoph-conrads.name/building-numpy-and-scipy-with-intel-compilers-and-intel-mkl/][another greate tutorial on installing only numpy and scipy with intel-mkl, no python]]
- [[http://deweeselab.berkeley.edu/Home/lab-members/chris-rodgers/compiling-numpy-and-scipy-with-mkl][another guide]]
- [[http://hpcwiki.uark.edu/doku.php/python][mkl hpc cluster]]
- [[http://deeplearning.net/software/theano/install.html][install numpy and scipy --with-openblas via brew]]
