_posts/2016-08-17-how-to-install-openmp-osx.html
layout: post
title: "How to install opemp support for clang on osx 10.11 el capitan"
date: 2016-08-17
comments: true
archive: true
notes: true
tags: notes
excerpt: Installation instructions regarding openmp support for clang

<p>
The easiest way to install opemp support for llvm clang compilesrs on
a mac osx 10.11 el capitan is via homebrew. We will use clang-omp
package from homebrew. The only problem is that clang-omp has been
removed from official homebrew repositories. But that is not a big
problem, because we can install even removed packages. The only thing
that we need to know is where the package resides in the homebrew
directory structure. In our case it is located
<code>homebrew/boneyard/clang-omp</code>.
</p>

<p>
Let's install it:
</p>

<p>
<code>brew install homebrew/boneyard/clang-omp</code>
</p>


<p>
Then follow instructions on the following websites
</p>

<ul class="org-ul">
<li><a href="https://clang-omp.github.io">clang-omp website</a></li>
<li><a href="http://stackoverflow.com/questions/33668323/clang-omp-in-xcode-under-el-capitan">stackoverflow</a></li>
<li><a href="https://forum.openframeworks.cc/t/openmp-under-osx/23999/2">openframworks</a></li>
<li><a href="http://superuser.com/questions/1110414/install-a-deleted-homebrew-formulae">stackexchange</a></li>
<li><a href="http://stackoverflow.com/questions/20321988/error-enabling-openmp-ld-library-not-found-for-lgomp-and-clang-errors/21789869#21789869">stackoverflow</a></li>
<li><a href="http://kylehalladay.com/all/blog/2014/07/15/Setting-Up-OpenMP-Mavericks.html">kylehalladay</a></li>
<li><a href="http://thecoatlessprofessor.com/programming/openmp-in-r-on-os-x/">thecoatlesprofessor</a></li>
<li><a href="https://software.intel.com/en-us/articles/using-intel-distribution-for-python-with-anaconda">important and easy intel-python installation on anaconda</a></li>
<li><a href="https://software.intel.com/en-us/articles/numpyscipy-with-intel-mkl">building numpy+scipy with intel-mkl</a></li>
<li><a href="https://software.intel.com/en-us/forums/intel-math-kernel-library/topic/383942">building numpy+scipy with intel-mkl 2</a></li>
<li><a href="https://thelostelectron.wordpress.com/tag/el-capitan/">install mkl compilers and libraries</a></li>
<li><a href="https://thelostelectron.wordpress.com/tag/el-capitan/">julia with mkl-intel</a></li>
<li><a href="http://quantlabs.net/blog/2015/12/instruction-to-get-python-data-science-working-on-mac/">install python, numpy-with-openblas</a></li>
<li><a href="http://dedupe.readthedocs.io/en/latest/OSX-Install-Notes.html">install python, numpy-with-openblas2</a></li>
<li><a href="http://deeplearning.net/software/theano/install_ubuntu.html#manual-openblas-instruction">install python, numpy-with-openblas3</a></li>
<li><a href="http://dedupe.readthedocs.io/en/latest/OSX-Install-Notes.html">haswell issues with openblas</a></li>
<li><a href="https://github.com/torch/dok/blob/master/docinstall/blas.md">detailed description installing torch against openblas and mkl-intel</a></li>
<li><a href="http://blog.yannisassael.com/2016/03/mkl-library-not-found-torch7/">install torch with intel-mkl</a></li>
<li><a href="https://www.arm-blog.com/setting-up-a-openvpn-server/">setting up an openvpn server</a></li>
<li><a href="http://javaguirre.me/2015/03/15/using-cyberghost-vpn-in-archlinux/">openvpn on different countries</a></li>
<li><a href="https://torrentfreak.com/which-vpn-services-take-your-anonymity-seriously-2014-edition-140315/2/">best anonymous proxies</a></li>
<li><a href="https://archlinuxarm.org/forum/viewtopic.php?f=31&amp;t=9283">troubleshooting openvpn issues on arch</a></li>
<li><a href="http://readwrite.com/2014/04/10/raspberry-pi-vpn-tutorial-server-secure-web-browsing/">building openvpn on raspherry pi</a></li>
<li><a href="http://minecraft.gamepedia.com/Tutorials/Setting_up_a_server">setting up VPN server not with openvpn</a></li>
<li><a href="https://www.digitalocean.com/community/tutorials/initial-server-setup-with-arch-linux">setting up linux server</a></li>
<li><a href="http://earthpy.org/speed.html">how to speed up your python code</a></li>
<li><a href="http://www.shocksolution.com/2008/09/installing-numpy-with-the-intel-math-kernel-library-mkl/">install numpy with mkl-intel</a></li>
<li><a href="http://www.ankitsrivastava.net/2014/05/installing-pythonnumpy-with-atlas-support/">install python/numpy with atlas</a></li>
<li><a href="http://www.cs.colostate.edu/~idfah/main/tutorials/npspmkl">install numpy &amp; scipy with openblas and mkl</a></li>
<li><a href="https://gehrcke.de/2014/02/building-numpy-and-scipy-with-intel-compilers-and-intel-mkl-on-a-64-bit-machine/">installing numpy &amp; scipy with mkl</a></li>
<li><a href="http://alexsavio.github.io/numpy_scipy_mkl.html">better guide to numpy,scipy with mkl and blas</a></li>
<li><a href="https://github.com/numpy/numpy/issues/3912">check if numpy is linked against blas and mkl</a></li>
<li><a href="https://blog.semicolonsoftware.de/compiling-python-numpy-and-scipy-with-intel-compilers-and-intel-mkl/">another very detailed and good guide to install python, numpy and scipy with intel-mkl</a></li>
<li><a href="https://christoph-conrads.name/building-numpy-and-scipy-with-intel-compilers-and-intel-mkl/">another greate tutorial on installing only numpy and scipy with intel-mkl, no python</a></li>
<li><a href="http://deweeselab.berkeley.edu/Home/lab-members/chris-rodgers/compiling-numpy-and-scipy-with-mkl">another guide</a></li>
<li><a href="http://hpcwiki.uark.edu/doku.php/python">mkl hpc cluster</a></li>
<li><a href="http://deeplearning.net/software/theano/install.html">install numpy and scipy &#x2013;with-openblas via brew</a></li>
</ul>
